sai14karthik/ESP32-Experiments-/esp-csi/examples/get-started/csi_recv_router/main/app_main.c
/*
 * SPDX-FileCopyrightText: 2026 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
/* Get recv router csi — wireless TCP forward + stall recovery for unattended capture. */

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <stdarg.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"

#include "nvs_flash.h"

#include "esp_mac.h"
#include "rom/ets_sys.h"
#include "esp_log.h"
#include "esp_wifi.h"
#include "esp_netif.h"
#include "esp_now.h"

#include "lwip/inet.h"
#include "lwip/netdb.h"
#include "lwip/sockets.h"
#include "ping/ping_sock.h"

#include "protocol_examples_common.h"
#include "esp_csi_gain_ctrl.h"
#include "csi_tcp_forward.h"

#define CONFIG_SEND_FREQUENCY      100
#if CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C61
#define CSI_FORCE_LLTF                      0
#endif
#define CONFIG_FORCE_GAIN                   0

#if CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32C61
#define CONFIG_GAIN_CONTROL                 1
#endif

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
#define ESP_IF_WIFI_STA ESP_MAC_WIFI_STA
#endif

/** Max CSI_DATA line length (header + I/Q text). Must match TCP forwarder. */
#define CSI_LINE_MAX 4096

/** No CSI for this long → restart ping (ms). */
#define CSI_STALL_PING_MS     8000
/** Still no CSI after ping restart → full Wi‑Fi/CSI recycle (ms). */
#define CSI_STALL_RECYCLE_MS  20000
#define CSI_WATCHDOG_PERIOD_MS 1000

static const char *TAG = "csi_recv_router";

static volatile TickType_t s_last_csi_tick;
static esp_ping_handle_t s_ping_handle = NULL;
static wifi_ap_record_t s_ap_info = {0};

static int csi_line_append(char *buf, size_t cap, int *off, const char *fmt, ...)
{
    if (*off < 0 || (size_t)*off >= cap) {
        *off = -1;
        return -1;
    }
    va_list ap;
    va_start(ap, fmt);
    int n = vsnprintf(buf + *off, cap - (size_t)*off, fmt, ap);
    va_end(ap);
    if (n < 0 || (size_t)(*off + n) >= cap) {
        *off = -1;
        return -1;
    }
    *off += n;
    return n;
}

static void wifi_csi_rx_cb(void *ctx, wifi_csi_info_t *info)
{
    if (!info || !info->buf) {
        ESP_LOGW(TAG, "<%s> wifi_csi_cb", esp_err_to_name(ESP_ERR_INVALID_ARG));
        return;
    }

    if (memcmp(info->mac, ctx, 6)) {
        return;
    }

    s_last_csi_tick = xTaskGetTickCount();

    const wifi_pkt_rx_ctrl_t *rx_ctrl = &info->rx_ctrl;
    static int s_count = 0;
    float compensate_gain = 1.0f;
    static uint8_t agc_gain = 0;
    static int8_t fft_gain = 0;
#if CONFIG_GAIN_CONTROL
    static uint8_t agc_gain_baseline = 0;
    static int8_t fft_gain_baseline = 0;
    esp_csi_gain_ctrl_get_rx_gain(rx_ctrl, &agc_gain, &fft_gain);
    if (s_count < 100) {
        esp_csi_gain_ctrl_record_rx_gain(agc_gain, fft_gain);
    } else if (s_count == 100) {
        esp_csi_gain_ctrl_get_rx_gain_baseline(&agc_gain_baseline, &fft_gain_baseline);
#if CONFIG_FORCE_GAIN
        esp_csi_gain_ctrl_set_rx_force_gain(agc_gain_baseline, fft_gain_baseline);
        ESP_LOGI(TAG, "fft_force %d, agc_force %d", fft_gain_baseline, agc_gain_baseline);
#endif
    }
    esp_csi_gain_ctrl_get_gain_compensation(&compensate_gain, agc_gain, fft_gain);
    ESP_LOGD(TAG, "compensate_gain %f, agc_gain %d, fft_gain %d", compensate_gain, agc_gain, fft_gain);
#endif

    char line[CSI_LINE_MAX];
    int off = 0;

#if CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32C61
    if (!s_count) {
        ESP_LOGI(TAG, "================ CSI RECV ================");
        ets_printf("type,seq,mac,rssi,rate,noise_floor,fft_gain,agc_gain,channel,local_timestamp,sig_len,rx_state,len,first_word,data\n");
    }
    csi_line_append(line, sizeof(line), &off,
                    "CSI_DATA,%d," MACSTR ",%d,%d,%d,%d,%d,%d,%d,%d,%d",
                    s_count, MAC2STR(info->mac), rx_ctrl->rssi, rx_ctrl->rate,
                    rx_ctrl->noise_floor, fft_gain, agc_gain, rx_ctrl->channel,
                    rx_ctrl->timestamp, rx_ctrl->sig_len, rx_ctrl->cur_bb_format);
#else
    if (!s_count) {
        ESP_LOGI(TAG, "================ CSI RECV ================");
        ets_printf("type,id,mac,rssi,rate,sig_mode,mcs,bandwidth,smoothing,not_sounding,aggregation,stbc,fec_coding,sgi,noise_floor,ampdu_cnt,channel,secondary_channel,local_timestamp,ant,sig_len,rx_format,len,first_word,data\n");
    }
    csi_line_append(line, sizeof(line), &off,
                    "CSI_DATA,%d," MACSTR ",%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d",
                    s_count, MAC2STR(info->mac), rx_ctrl->rssi, rx_ctrl->rate, rx_ctrl->sig_mode,
                    rx_ctrl->mcs, rx_ctrl->cwb, rx_ctrl->smoothing, rx_ctrl->not_sounding,
                    rx_ctrl->aggregation, rx_ctrl->stbc, rx_ctrl->fec_coding, rx_ctrl->sgi,
                    rx_ctrl->noise_floor, rx_ctrl->ampdu_cnt, rx_ctrl->channel, rx_ctrl->secondary_channel,
                    rx_ctrl->timestamp, rx_ctrl->ant, rx_ctrl->sig_len, rx_ctrl->sig_mode);
#endif

#if (CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C61) && CSI_FORCE_LLTF
    int16_t csi = ((int16_t)(((((uint16_t)info->buf[1]) << 8) | info->buf[0]) << 4) >> 4);
    csi_line_append(line, sizeof(line), &off, ",%d,%d,\"[%d",
                    (info->len - 2) / 2, info->first_word_invalid, (int16_t)(compensate_gain * csi));
    for (int i = 2; i < (info->len - 2) && off >= 0; i += 2) {
        csi = ((int16_t)(((((uint16_t)info->buf[i + 1]) << 8) | info->buf[i]) << 4) >> 4);
        csi_line_append(line, sizeof(line), &off, ",%d", (int16_t)(compensate_gain * csi));
    }
#else
    csi_line_append(line, sizeof(line), &off, ",%d,%d,\"[%d",
                    info->len, info->first_word_invalid, (int16_t)(compensate_gain * info->buf[0]));
    for (int i = 1; i < info->len && off >= 0; i++) {
        csi_line_append(line, sizeof(line), &off, ",%d", (int16_t)(compensate_gain * info->buf[i]));
    }
#endif
    csi_line_append(line, sizeof(line), &off, "]\"\n");

    if (off > 0) {
        ets_printf("%s", line);
        csi_tcp_forward_enqueue(line, (size_t)off);
    } else {
        ESP_LOGW(TAG, "CSI line truncated (>%d); skipped TCP", CSI_LINE_MAX);
    }
    s_count++;
}

static void wifi_csi_init(void)
{
#if CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C61
    wifi_csi_config_t csi_config = {
        .enable                   = true,
        .acquire_csi_legacy       = true,
        .acquire_csi_force_lltf   = CSI_FORCE_LLTF,
        .acquire_csi_ht20         = true,
        .acquire_csi_ht40         = true,
        .acquire_csi_vht          = false,
        .acquire_csi_su           = false,
        .acquire_csi_mu           = false,
        .acquire_csi_dcm          = false,
        .acquire_csi_beamformed   = false,
        .acquire_csi_he_stbc_mode = 2,
        .val_scale_cfg            = 0,
        .dump_ack_en              = false,
        .reserved                 = false
    };
#elif CONFIG_IDF_TARGET_ESP32C6
    wifi_csi_config_t csi_config = {
        .enable                 = true,
        .acquire_csi_legacy     = true,
        .acquire_csi_ht20       = true,
        .acquire_csi_ht40       = true,
        .acquire_csi_su         = false,
        .acquire_csi_mu         = false,
        .acquire_csi_dcm        = false,
        .acquire_csi_beamformed = false,
        .acquire_csi_he_stbc    = 2,
        .val_scale_cfg          = false,
        .dump_ack_en            = false,
        .reserved               = false
    };
#else
    wifi_csi_config_t csi_config = {
        .lltf_en           = true,
        .htltf_en          = false,
        .stbc_htltf2_en    = false,
        .ltf_merge_en      = true,
        .channel_filter_en = true,
        .manu_scale        = true,
        .shift             = true,
    };
#endif
    memset(&s_ap_info, 0, sizeof(s_ap_info));
    ESP_ERROR_CHECK(esp_wifi_sta_get_ap_info(&s_ap_info));
    ESP_ERROR_CHECK(esp_wifi_set_csi_config(&csi_config));
    ESP_ERROR_CHECK(esp_wifi_set_csi_rx_cb(wifi_csi_rx_cb, s_ap_info.bssid));
    ESP_ERROR_CHECK(esp_wifi_set_csi(true));
}

static void wifi_ping_router_stop(void)
{
    if (s_ping_handle) {
        esp_ping_stop(s_ping_handle);
        esp_ping_delete_session(s_ping_handle);
        s_ping_handle = NULL;
    }
}

static esp_err_t wifi_ping_router_start(void)
{
    wifi_ping_router_stop();

    esp_ping_config_t ping_config = ESP_PING_DEFAULT_CONFIG();
    ping_config.count             = 0;
    ping_config.interval_ms       = 1000 / CONFIG_SEND_FREQUENCY;
    ping_config.task_stack_size   = 3072;
    ping_config.data_size         = 1;

    esp_netif_ip_info_t local_ip;
    esp_netif_get_ip_info(esp_netif_get_handle_from_ifkey("WIFI_STA_DEF"), &local_ip);
    ESP_LOGI(TAG, "got ip:" IPSTR ", gw: " IPSTR, IP2STR(&local_ip.ip), IP2STR(&local_ip.gw));
    ping_config.target_addr.u_addr.ip4.addr = ip4_addr_get_u32(&local_ip.gw);
    ping_config.target_addr.type = ESP_IPADDR_TYPE_V4;

    esp_ping_callbacks_t cbs = { 0 };
    esp_err_t err = esp_ping_new_session(&ping_config, &cbs, &s_ping_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "ping session create failed: %s", esp_err_to_name(err));
        return err;
    }
    return esp_ping_start(s_ping_handle);
}

static void wifi_disable_power_save(void)
{
    esp_err_t err = esp_wifi_set_ps(WIFI_PS_NONE);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "WIFI_PS_NONE failed: %s", esp_err_to_name(err));
    } else {
        ESP_LOGI(TAG, "Wi‑Fi power save OFF (WIFI_PS_NONE)");
    }
}

static void csi_pipeline_start(void)
{
    wifi_disable_power_save();
    wifi_csi_init();
    wifi_ping_router_start();
    s_last_csi_tick = xTaskGetTickCount();
}

/** Soft recover: restart ping to re-stimulate router CSI.
 *  Do not tear down TCP — that drops Mini ingest and causes reconnect storms.
 */
static void csi_recover_ping(void)
{
    ESP_LOGW(TAG, "CSI stall → restart ping (TCP stays up)");
    wifi_ping_router_start();
}

/** Hard recover: drop Wi‑Fi, reconnect, re-enable CSI + ping. */
static void csi_recover_full(void)
{
    ESP_LOGW(TAG, "CSI stall → full Wi‑Fi/CSI recycle");
    wifi_ping_router_stop();
    esp_wifi_set_csi(false);
    example_disconnect();
    vTaskDelay(pdMS_TO_TICKS(1000));
    ESP_ERROR_CHECK(example_connect());
    csi_pipeline_start();
    csi_tcp_forward_force_reconnect();
}

static void csi_watchdog_task(void *arg)
{
    (void)arg;
    ESP_LOGI(TAG, "CSI watchdog up (ping>%ds recycle>%ds)",
             CSI_STALL_PING_MS / 1000, CSI_STALL_RECYCLE_MS / 1000);

    bool ping_attempted = false;

    while (true) {
        vTaskDelay(pdMS_TO_TICKS(CSI_WATCHDOG_PERIOD_MS));

        TickType_t last = s_last_csi_tick;
        TickType_t now = xTaskGetTickCount();
        uint32_t idle_ms = (uint32_t)((now - last) * portTICK_PERIOD_MS);

        wifi_ap_record_t ap;
        bool wifi_up = (esp_wifi_sta_get_ap_info(&ap) == ESP_OK);

        if (!wifi_up) {
            ESP_LOGW(TAG, "Wi‑Fi down → reconnect");
            ping_attempted = false;
            csi_recover_full();
            continue;
        }

        if (idle_ms < CSI_STALL_PING_MS) {
            ping_attempted = false;
            continue;
        }

        if (!ping_attempted) {
            ping_attempted = true;
            csi_recover_ping();
            continue;
        }

        if (idle_ms >= CSI_STALL_RECYCLE_MS) {
            ping_attempted = false;
            csi_recover_full();
        }
    }
}

void app_main(void)
{
    ESP_ERROR_CHECK(nvs_flash_init());
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());

    ESP_ERROR_CHECK(example_connect());

    csi_tcp_forward_start();
    csi_pipeline_start();

    xTaskCreate(csi_watchdog_task, "csi_wd", 4096, NULL, 4, NULL);
}
